<?php

/* Описание скалярных переменных */

$a      = 15;        # целое
$fl     = 3.14;         # с плавающей точкой
$boo     = TRUE;         # boolean
$str    = "0x22stroka";     # строка
$nol    = 0;
$pusto    = "";

$s1 = "Переменная a = $a \n";   # разбираемая строка
$s2 = 'Переменная a = $a \n';   # неразбираемая строка

/* Описание массива */

$mas = array( "one" => TRUE,
        1   => -20,
          "three" => 3.14);
$mas[]="two";
$mas["four"]=4;

// Выведет: Array ( [one] => 1 [1] => -20 [three] => 3.14 [2] => two [four] => 4 )

/* Описание константы */

define("HOST", "kappa.cs.karelia.ru");


/* Вывод значения переменной на экран */
// echo $a, "\n";

//echo $s1, "\n"; // Переменная a = 15
//echo $s2, "\n"; // Переменная a = $a \n
//print_r($mas); // вывод массива



//exit(111);
?>
